<?php

namespace Phonetics;

require_once __DIR__ . '/simple_parser.php';

//============================================================================
// X-SAMPA to IPA parser, with some of Z-SAMPA extensions
// right now parses just a few most common symbols
//============================================================================

class XSAMPA_Parser extends Simple_Parser
implements
	Reversible_Parser {
	
	protected $transition = array(
		
		// modifiers
		// must be first to avoid collisions
		
		'_d' => '̪',
		'_h' => 'ʰ',
		'_j' => 'ʲ',
		'_l' => 'ˡ',
		'_w' => 'ʷ',
		'_G' => 'ˠ',
		'_0' => '̥',
		'_=' => '̩',
		'_>' => 'ʼ',
		'_~'  => '̃',
		
		// short modifiers
		'=' => '̩',
		'~'  => '̃',
		
		// lowercase letters
		
		'd`'  => 'ɖ',
		'h\\' => 'ɦ',
		'i\\' => 'ɨ',
		'l`'  => 'ɭ',
		'n`'  => 'ɳ',
		'u\\' => 'ʉ',
		'r`'  => 'ɽ',
		's`'  => 'ʂ',
		's\\' => 'ɕ',
		't`'  => 'ʈ',
		'z`'  => 'ʐ',
		'z\\' => 'ʑ',
		
		// uppercase letters
		
		'A'   => 'ɑ',
		'B'   => 'β',
		'B\\' => 'ʙ',
		'D'   => 'ð',
		'E'   => 'ɛ',
		'F'   => 'ɱ',
		'G'   => 'ɣ',
		'G\\' => 'ɢ',
		'H'   => 'ɥ',
		'H\\' => 'ʜ',
		'I'   => 'ɪ',
		'J'   => 'ɲ',
		'L'   => 'ʎ',
		'L\\' => 'ʟ',
		'M'   => 'ɯ',
		'M\\' => 'ɰ',
		'N'   => 'ŋ',
		'N\\' => 'ɴ',
		'O'   => 'ɔ',
		'Q'   => 'ɒ',
		'R'   => 'ʁ',
		'R\\' => 'ʀ',
		'S'   => 'ʃ',
		'T'   => 'θ',
		'U'   => 'ʊ',
		'V'   => 'ʌ',
		'W'   => 'ʍ',
		'X'   => 'χ',
		'Z'   => 'ʒ',
		
		// other symbols
		
		'"'   => 'ˈ',
		'@'   => 'ə',
		'@\\' => 'ɘ',
		':'   => 'ː',
		','   => 'ˌ',
		'%'   => 'ˌ',
		'1'   => 'ɨ',
		'2'   => 'ø',
		'3'   => 'ɜ',
		'3\\' => 'ɞ',
		'4'   => 'ɾ',
		'6'   => 'ɐ',
		'7'   => 'ɤ',
		'8'   => 'ɵ',
		'9'   => 'œ',
		'&'   => 'ɶ',
		'?'   => 'ʔ',
		'?\\' => 'ʕ',
		
	);
	
}

?>
